app/controllers/clients_controller.rb

SELECT * FROM "clients"
---
  def index
    @clients = Client.all()

SELECT * FROM "clients" WHERE ("clients"."session_id" = '123') LIMIT 1
UPDATE "clients" SET "updated_at" = '2009-07-22 19:59:12', "last_request" = '2009-07-22 19:59:12' WHERE "session_id" = 'dbf8ec26-76f3-11de-9464-00247e13e797'
---
  def status(session_id)
    @client = Client.find_by_session_id(session_id)
    @rsp = ClientStatus.new
    if @client.nil?
      raise XMLRPC::FaultException.new(-3, "Client not found")
    else
      @rsp.state = @client.state
      if @client.state == "connected"
        @rsp.type = @client.type()
      end
      @client.update_attribute("last_request", Time.now)

SELECT * FROM "clients" WHERE ("clients"."session_id" = 'dbf8ec26-76f3-11de-9464-00247e13e797') LIMIT 1
SELECT * FROM "customers" WHERE ("customers"."login" = 'guillau') LIMIT 1
UPDATE "customers" SET "updated_at" = '2009-07-25 17:01:25', "last_login_at" = '2009-07-25 17:01:25' WHERE "id" = 2
UPDATE "clients" SET "updated_at" = '2009-07-25 17:01:25', "customer_id" = 2, "last_request" = '2009-07-25 17:01:25' WHERE "session_id" = 'dbf8ec26-76f3-11de-9464-00247e13e797'
---
  def connect_customer(session_id, login, password)
    @client = Client.find_by_session_id(session_id)
    if @client.nil?
      raise XMLRPC::FaultException.new(-3, "Client not found")
    else
      if @client.state =="connected"
        raise XMLRPC::FaultException.new(-10, "Already connected")
      else
        @customer = Customer.find_by_login(login)
        if @customer.nil?
          raise XMLRPC::FaultException.new(-4, "Login not found")
          Operation.add(I18n.t('operations.customers.connection_login_invalid', :login => login))
        else
          if !@customer.valid_password?(password)
            raise XMLRPC::FaultException.new(-5, "Password invalid")
            Operation.add(I18n.t('operations.customers.connection_password_invalid', :login => login))
          else
            if @customer.time == 0
              raise XMLRPC::FaultException.new(-6, "No time left")
              Operation.add(I18n.t('operations.customers.connection_no_time_left', :login => login))
            else
              @client.connect!
              @customer.update_attribute("last_login_at", Time.now)
              @client.update_attributes(:customer_id => @customer.id, :last_request => Time.now)

SELECT * FROM "clients" WHERE ("clients"."session_id" = 'dbf8ec26-76f3-11de-9464-00247e13e797') LIMIT 1
SELECT * FROM "timecodes" WHERE ("timecodes"."code" = '578f9958') LIMIT 1
DELETE FROM "timecodes" WHERE "id" = 3
UPDATE "clients" SET "updated_at" = '2009-07-25 17:20:26', "last_request" = '2009-07-25 17:20:26', "timecode_id" = 3 WHERE "session_id" = 'dbf8ec26-76f3-11de-9464-00247e13e797'
---
  def connect_timecode(session_id, code)
    @client = Client.find_by_session_id(session_id)
    if @client.nil?
      raise XMLRPC::FaultException.new(-3, "Client not found")
    else
      if @client.state == "connected"
        raise XMLRPC::FaultException.new(-10, "Already connected")
      else
        @timecode = Timecode.find_by_code(code)
        if @timecode.nil?
          raise XMLRPC::FaultException.new(-7, "Timecode not found")
          Operation.add(I18n.t('operations.timecodes.connection_not_found', :code => code))
        else
          if !@timecode.is_valid?
            raise XMLRPC::FaultException.new(-8, "Timecode is invalid")
            Operation.add(I18n.t('operations.timecodes.connection_invalid', :code => @timecode.code))
            @timecode.destroy
          else
            if !@timecode.customer.nil?
              raise XMLRPC::FaultException.new(-9, "Timecode is associated with a customer. Please login using your customer's account")
              Operation.add(I18n.t('operations.timecodes.connection_invalid', :code => @timecode.code))
            else
              @client.connect!
              @client.update_attributes(:timecode_id => @timecode.id, :last_request => Time.now)

SELECT * FROM "clients" WHERE ("clients"."session_id" = 'a40191f2-76f7-11de-9464-00247e13e797') LIMIT 1
UPDATE "clients" SET "updated_at" = '2009-07-25 17:39:33', "state" = 'available' WHERE "session_id" = 'a40191f2-76f7-11de-9464-00247e13e797'
---
  def disconnect(session_id)
    @client = Client.find_by_session_id(session_id)
    if @client.nil?
      raise XMLRPC::FaultException.new(-3, "Client not found")
    else
      # TODO: Destroy timer
      if @client.type() == "timecode"
        Operation.add(I18n.t('operations.timecodes.disconnect', :code => @client.timecode.code))
      elsif @client.type() == "customer"
        Operation.add(I18n.t('operations.customers.disconnect', :login => @client.customer.login))
      end
      if @client.state == "connected"
        @client.disconnect!
        @client.update_attributes(:timecode_id => nil, :customer_id => nil)