app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "salt", "created_at", "crypted_password", "updated_at", "phone", "question", "login", "last_login_at", "email", "answer") VALUES('', '735978d7238e4d8bb4405969236e14729b0e9adb', '2009-07-22 15:56:42', '1bbc3d3f185ea816e9a74c30ed16aa62212bba0d', '2009-07-22 15:56:42', '', '', 'guillaume', NULL, '', '')
SELECT "customers".id FROM "customers" WHERE ("customers"."login" = '') LIMIT 1
---
  def create
		@db_customer = Customer.new
    @db_customer.uid = params[:customer][:uid]
    @customer = LdapCustomer.new(params[:customer])
    @customer.cn = @customer.givenName + ' ' + @customer.sn
    @customer.gid_number = 1100
    @customer.uid_number = get_uid()
    @customer.home_directory = "/home/" + params[:customer][:uid]
    @customer.loginShell = "/bin/bash"
    # Format of the quota attribute:
    # Partition:Soft limit in blocks:Hard limit in blocks:Soft limit in files:Hard limit in files
    # 40960 blocks = 10 MB on a filesystem which has 4096 as the block size
    @customer.quota = "/dev/sda1:204800:245760:0:0"
    @group = LdapGroup.find("customers")
    if @customer.save
      success = @db_customer && @db_customer.save
      @group.members << @customer
      if success && @customer.errors.empty?

SELECT * FROM "customers" WHERE ("customers"."id" = '1') LIMIT 1
DELETE FROM "customers" WHERE "id" = 1
---
  def destroy
		@customer = Customer.find(params[:id])
		if @customer
      if LdapCustomer.exists?(@customer.uid)
        LdapCustomer.destroy(@customer.uid)