app/controllers/employees_controller.rb

SELECT * FROM "employees" WHERE ("employees"."id" = 2) LIMIT 1
---
	def index
		@employees = Employee.find(:all)

INSERT INTO "employees" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "is_admin", "remember_token", "login") VALUES('', '143248903b5931c09baa65f830d7abc4e782e06c', '2009-06-15 12:03:47', '03faf244853eefe778c06c7c2acdf168191a1e2b', NULL, '2009-06-15 12:03:47', NULL, NULL, 'admin')
---
	def create
		@employee = Employee.new(params[:employee])
		success = @employee && @employee.save

SELECT * FROM "employees" WHERE ("employees"."id" = 2) LIMIT 1
DELETE FROM "employees" WHERE "id" = 3
---
	def destroy
		@employee = Employee.find_by_id(params[:id])
		if @employee
			@employee.destroy

SELECT * FROM "employees" WHERE ("employees"."id" = 2) LIMIT 1
---
	def edit
		@employee = Employee.find_by_id(params[:id])

SELECT * FROM "employees" WHERE ("employees"."id" = 2) LIMIT 1
UPDATE "employees" SET "updated_at" = '2009-06-27 19:51:06', "crypted_password" = '672df952506e733dd24270a24d5f8a9da0135fdd' WHERE "id" = 2
---
	def update
		@employee = Employee.find_by_id(params[:id])
		if @employee.update_attributes(params[:employee])

UPDATE "employees" SET "updated_at" = '2009-06-27 22:13:35', "name" = 'Guillaume Viguier' WHERE "id" = 2
---
	def update_profile
		if current_employee.update_attributes(params[:employee])