app/controllers/models_controller.rb

INSERT INTO "models" ("price", "created_at", "title", "updated_at", "expiration", "time") VALUES(15, '2009-06-28 01:19:05', '1HEURE', '2009-06-28 01:19:05', 30, 60)
---
	def create
		@model = Model.new(params[:model])
		if @model.save

SELECT * FROM "models" WHERE ("models"."id" = '3') LIMIT 1
DELETE FROM "models" WHERE "id" = 3
---
	def destroy
		@model = Model.find_by_id(params[:id])
		if @model
			@model.destroy

SELECT * FROM "models" WHERE ("models"."id" = '1') LIMIT 1
---
	def edit
		@model = Model.find_by_id(params[:id])

SELECT * FROM "models" WHERE ("models"."id" = '1') LIMIT 1
UPDATE "models" SET "updated_at" = '2009-07-04 22:12:30', "price" = 150 WHERE "id" = 1
---
	def update
		@model = Model.find_by_id(params[:id])
		if @model.update_attributes(params[:model])