app/controllers/operations_controller.rb

SELECT * FROM "operations"
---
	def index
    if(params[:operation_type].nil?)
      @operations = Operation.paginate :page => params[:page], :order => "created_at DESC"