app/controllers/timecodes_controller.rb

SELECT * FROM "timecodes"
---
	def index
		if(params[:q].nil?)
			@timecodes = Timecode.paginate :conditions => ["user_id IS NULL"], :page => params[:page], :order => "created_at DESC"

SELECT * FROM "models" WHERE ("models"."id" = '1') LIMIT 1
INSERT INTO "timecodes" ("price", "unlimited", "created_at", "expires", "code", "updated_at", "expiration", "time", "customer_id") VALUES(15, 'f', '2009-07-22 14:35:28', 't', '578f9956', '2009-07-22 14:35:28', '2009-08-21 14:35:28', 60, NULL)
---
	def create
		@model = Model.find_by_id(params[:model][:id])
		if @model
			@timecode = Timecode.new_from_model(@model)
			if @timecode.save

SELECT * FROM "timecodes" WHERE ("timecodes"."id" IS NULL) LIMIT 1
DELETE FROM "timecodes" WHERE "id" = 4
---
	def destroy
		@timecode = Timecode.find_by_id(params[:id])
		if @timecode
			code = @timecode.code
			user = @timecode.user
			user_id = nil
			unless user.nil?
				if(user.is_admin? && current_user.is_employee?)
					flash[:error] = t 'sessions.admin_required'
					redirect_to :controller=> "users", :action => "show", :id => user.id
					return
				end
				user_id = user.id
			end
			if current_user.is_admin? # The employee is an admin, he can delete whatever he wants
				destroy_sale(@timecode) if @timecode.created_at == @timecode.updated_at
				@timecode.destroy