app/controllers/timecodes_controller.rb

DELETE FROM "credits" WHERE "id" = 1
---
	def destroy
		@timecode = Timecode.find_by_id(params[:id])
		if @timecode
			code = @timecode.code
			if current_employee.is_admin # The employee is an admin, he can delete whatever he wants
        destroy_credit(@timecode) if @timecode.created_at == @timecode.updated_at
				@timecode.destroy